/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   check_sign.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: mashley <marvin@42.fr>                     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/11/10 18:36:58 by mashley           #+#    #+#             */
/*   Updated: 2019/11/10 18:37:01 by mashley          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "includes/fillit.h"

/*
 * В валидной тетраминке должно быть 12 точек, 4 решётки и 4-5 переносов
 * строки на определённых индексах
 *
 * Функция возвращает 1 если это так и 0 в остальных случаях
 * */

int	check_sign(char *tetr)
{
	int len;

	len = ft_strlen(tetr);
	if (ft_strcount(tetr, '.') != 12)
		return (0);
	if (ft_strcount(tetr, '#') != 4)
		return (0);
	if (ft_strcount(tetr, '\n') != (len / 5 + len % 5))
		return (0);
	if (tetr[4] != '\n' || tetr[9] != '\n' ||
		tetr[14] != '\n' || tetr[19] != '\n')
		return (0);
	return (1);
}
