/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   validation.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: mashley <marvin@42.fr>                     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/11/08 11:53:13 by mashley           #+#    #+#             */
/*   Updated: 2019/11/08 11:53:21 by mashley          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "includes/fillit.h"

/*
 * Функция проверяет считанную тетраминку на валидность
 *
 * Возвращает 1 если валидна и 0 если не валидна
 * */

int	validation(char *tetr)
{
	char **tmp;

	if (!(check_sign(tetr)))
		return (0);
	tmp = ft_strsplit(tetr, '\n');
	if (check_neig1(tmp) + check_neig2(tmp) < 6)
		return (0);
	return (1);
}
