/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   input.c                                            :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: mashley <marvin@42.fr>                     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/10/29 15:00:55 by mashley           #+#    #+#             */
/*   Updated: 2019/10/29 15:15:51 by mashley          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

while ((ret = read(fd, buff, 5))
		{
			buff[ret] = '\0';
			//Сохраняем прочитанное
			ret = read(fd, buff, 5);
			buff[ret] = '\0';
			//Сохраняем прочитанное
			ret = read(fd, buff, 5)
			buff[ret] = '\0';
			//Сохраняем прочитанное
			ret = read(fd, buff, 5)
			buff[ret] = '\0';
			//Сохраняем прочитанное
			ret = read(fd, buff, 1)
			buff[ret] = '\0';
			//Сохраняем прочитанное
		}
